rottenpotatoes/app/controllers/movies_controller.rb

  def similar_director
    id = params[:id]
    @director = Movie.find(id).director
---
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "Oleg"]]